Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.3.111/include/proc/p32mz2064dab169.h
extern volatile __SBT12REG0bits_t SBT12REG0bits __asm__ ("SBT12REG0") __attribute__((section("sfrs"), address(0xBF909840)));
#define SBT12RD0 SBT12RD0
extern volatile uint32_t   SBT12RD0 __attribute__((section("sfrs"), address(0xBF909850)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT12RD0bits_t;
extern volatile __SBT12RD0bits_t SBT12RD0bits __asm__ ("SBT12RD0") __attribute__((section("sfrs"), address(0xBF909850)));
#define SBT12WR0 SBT12WR0
extern volatile uint32_t   SBT12WR0 __attribute__((section("sfrs"), address(0xBF909858)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT12WR0bits_t;
extern volatile __SBT12WR0bits_t SBT12WR0bits __asm__ ("SBT12WR0") __attribute__((section("sfrs"), address(0xBF909858)));
#define SBFLAG2 SBFLAG2
extern volatile uint32_t   SBFLAG2 __attribute__((section("sfrs"), address(0xBF910510)));
typedef struct {
  uint32_t T13PGV:1;
  uint32_t T14PGV:1;
  uint32_t T15PGV:1;
  uint32_t T0PGV2:1;
} __SBFLAG2bits_t;
extern volatile __SBFLAG2bits_t SBFLAG2bits __asm__ ("SBFLAG2") __attribute__((section("sfrs"), address(0xBF910510)));
#define SBT13ELOG1 SBT13ELOG1
extern volatile uint32_t   SBT13ELOG1 __attribute__((section("sfrs"), address(0xBF918420)));
typedef struct {
  uint32_t CMD:3;
  uint32_t :1;
  uint32_t REGION:4;
  uint32_t INITID:8;
  uint32_t :8;
  uint32_t CODE:4;
  uint32_t :3;
  uint32_t MULTI:1;
} __SBT13ELOG1bits_t;
extern volatile __SBT13ELOG1bits_t SBT13ELOG1bits __asm__ ("SBT13ELOG1") __attribute__((section("sfrs"), address(0xBF918420)));
#define SBT13ELOG2 SBT13ELOG2
extern volatile uint32_t   SBT13ELOG2 __attribute__((section("sfrs"), address(0xBF918424)));
typedef struct {
  uint32_t GROUP:2;
} __SBT13ELOG2bits_t;
extern volatile __SBT13ELOG2bits_t SBT13ELOG2bits __asm__ ("SBT13ELOG2") __attribute__((section("sfrs"), address(0xBF918424)));
#define SBT13ECON SBT13ECON
extern volatile uint32_t   SBT13ECON __attribute__((section("sfrs"), address(0xBF918428)));
typedef struct {
  uint32_t :24;
  uint32_t ERRP:1;
} __SBT13ECONbits_t;
extern volatile __SBT13ECONbits_t SBT13ECONbits __asm__ ("SBT13ECON") __attribute__((section("sfrs"), address(0xBF918428)));
#define SBT13ECLRS SBT13ECLRS
extern volatile uint32_t   SBT13ECLRS __attribute__((section("sfrs"), address(0xBF918430)));
typedef struct {
  uint32_t CLEAR:1;
} __SBT13ECLRSbits_t;
extern volatile __SBT13ECLRSbits_t SBT13ECLRSbits __asm__ ("SBT13ECLRS") __attribute__((section("sfrs"), address(0xBF918430)));
#define SBT13ECLRM SBT13ECLRM
extern volatile uint32_t   SBT13ECLRM __attribute__((section("sfrs"), address(0xBF918438)));
typedef struct {
  uint32_t CLEAR:1;
} __SBT13ECLRMbits_t;
extern volatile __SBT13ECLRMbits_t SBT13ECLRMbits __asm__ ("SBT13ECLRM") __attribute__((section("sfrs"), address(0xBF918438)));
#define SBT13REG0 SBT13REG0
extern volatile uint32_t   SBT13REG0 __attribute__((section("sfrs"), address(0xBF918440)));
typedef struct {
  uint32_t :3;
  uint32_t SIZE:5;
  uint32_t :1;
  uint32_t PRI:1;
  uint32_t BASE:22;
} __SBT13REG0bits_t;
extern volatile __SBT13REG0bits_t SBT13REG0bits __asm__ ("SBT13REG0") __attribute__((section("sfrs"), address(0xBF918440)));
#define SBT13RD0 SBT13RD0
extern volatile uint32_t   SBT13RD0 __attribute__((section("sfrs"), address(0xBF918450)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT13RD0bits_t;
extern volatile __SBT13RD0bits_t SBT13RD0bits __asm__ ("SBT13RD0") __attribute__((section("sfrs"), address(0xBF918450)));
#define SBT13WR0 SBT13WR0
extern volatile uint32_t   SBT13WR0 __attribute__((section("sfrs"), address(0xBF918458)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT13WR0bits_t;
extern volatile __SBT13WR0bits_t SBT13WR0bits __asm__ ("SBT13WR0") __attribute__((section("sfrs"), address(0xBF918458)));
#define SBT13REG1 SBT13REG1
extern volatile uint32_t   SBT13REG1 __attribute__((section("sfrs"), address(0xBF918460)));
typedef struct {
  uint32_t :3;
  uint32_t SIZE:5;
  uint32_t :1;
  uint32_t PRI:1;
  uint32_t BASE:22;
} __SBT13REG1bits_t;
extern volatile __SBT13REG1bits_t SBT13REG1bits __asm__ ("SBT13REG1") __attribute__((section("sfrs"), address(0xBF918460)));
#define SBT13RD1 SBT13RD1
extern volatile uint32_t   SBT13RD1 __attribute__((section("sfrs"), address(0xBF918470)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT13RD1bits_t;
extern volatile __SBT13RD1bits_t SBT13RD1bits __asm__ ("SBT13RD1") __attribute__((section("sfrs"), address(0xBF918470)));
#define SBT13WR1 SBT13WR1
extern volatile uint32_t   SBT13WR1 __attribute__((section("sfrs"), address(0xBF918478)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT13WR1bits_t;
extern volatile __SBT13WR1bits_t SBT13WR1bits __asm__ ("SBT13WR1") __attribute__((section("sfrs"), address(0xBF918478)));
#define SBT14ELOG1 SBT14ELOG1
extern volatile uint32_t   SBT14ELOG1 __attribute__((section("sfrs"), address(0xBF918820)));
typedef struct {
  uint32_t CMD:3;
  uint32_t :1;
  uint32_t REGION:4;
  uint32_t INITID:8;
  uint32_t :8;
  uint32_t CODE:4;
  uint32_t :3;
  uint32_t MULTI:1;
} __SBT14ELOG1bits_t;
extern volatile __SBT14ELOG1bits_t SBT14ELOG1bits __asm__ ("SBT14ELOG1") __attribute__((section("sfrs"), address(0xBF918820)));
#define SBT14ELOG2 SBT14ELOG2
extern volatile uint32_t   SBT14ELOG2 __attribute__((section("sfrs"), address(0xBF918824)));
typedef struct {
  uint32_t GROUP:2;
} __SBT14ELOG2bits_t;
extern volatile __SBT14ELOG2bits_t SBT14ELOG2bits __asm__ ("SBT14ELOG2") __attribute__((section("sfrs"), address(0xBF918824)));
#define SBT14ECON SBT14ECON
extern volatile uint32_t   SBT14ECON __attribute__((section("sfrs"), address(0xBF918828)));
typedef struct {
  uint32_t :24;
  uint32_t ERRP:1;
} __SBT14ECONbits_t;
extern volatile __SBT14ECONbits_t SBT14ECONbits __asm__ ("SBT14ECON") __attribute__((section("sfrs"), address(0xBF918828)));
#define SBT14ECLRS SBT14ECLRS
extern volatile uint32_t   SBT14ECLRS __attribute__((section("sfrs"), address(0xBF918830)));
typedef struct {
  uint32_t CLEAR:1;
} __SBT14ECLRSbits_t;
extern volatile __SBT14ECLRSbits_t SBT14ECLRSbits __asm__ ("SBT14ECLRS") __attribute__((section("sfrs"), address(0xBF918830)));
#define SBT14ECLRM SBT14ECLRM
extern volatile uint32_t   SBT14ECLRM __attribute__((section("sfrs"), address(0xBF918838)));
typedef struct {
  uint32_t CLEAR:1;
} __SBT14ECLRMbits_t;
extern volatile __SBT14ECLRMbits_t SBT14ECLRMbits __asm__ ("SBT14ECLRM") __attribute__((section("sfrs"), address(0xBF918838)));
#define SBT14REG0 SBT14REG0
extern volatile uint32_t   SBT14REG0 __attribute__((section("sfrs"), address(0xBF918840)));
typedef struct {
  uint32_t :3;
  uint32_t SIZE:5;
  uint32_t :1;
  uint32_t PRI:1;
  uint32_t BASE:22;
} __SBT14REG0bits_t;
extern volatile __SBT14REG0bits_t SBT14REG0bits __asm__ ("SBT14REG0") __attribute__((section("sfrs"), address(0xBF918840)));
#define SBT14RD0 SBT14RD0
extern volatile uint32_t   SBT14RD0 __attribute__((section("sfrs"), address(0xBF918850)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT14RD0bits_t;
